

&НаКлиенте
Процедура ВременныеИнтервалыПриАктивизацииСтроки(Элемент)
	
	УстановитьТекущийТэгВременногоИнтервала();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗапуститьТаймерИнтервала(Команда)
	
	ЗафиксироватьНачалоВременногоИнтервала();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьНачалоВременногоИнтервала()
	
	НачалоВременногоИнтервала = ТекущаяДата();
	
	НовыйИнтервал = ЛогВременныхИнтервалов.Добавить();
	НовыйИнтервал.НачалоВременногоИнтервала = НачалоВременногоИнтервала;
	НовыйИнтервал.ТэгВременногоИнтервала = ТэгВременногоИнтервала;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущийТэгВременногоИнтервала()
	
	Если Элементы.ВременныеИнтервалы.ТекущаяСтрока = 0 Тогда
		ТэгВременногоИнтервала = Элементы.ВременныеИнтервалы.ТекущиеДанные.ТэгВременногоИнтервала;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДлительностьВременныхИнтервалов()
	
	ВременныеИнтервалы.Очистить();
	НачалоПредыдущегоИнтервала = ТекущаяДата();
	
	КоличествоЛогов = ЛогВременныхИнтервалов.Количество() - 1;
	Пока КоличествоЛогов >= 0 Цикл
		
		СтрокаИнтервала = ЛогВременныхИнтервалов.НайтиПоИдентификатору(КоличествоЛогов);
		КоличествоЛогов = КоличествоЛогов - 1;
		
//		Если НачалоПредыдущегоИнтервала = Неопределено Тогда
//			НачалоПредыдущегоИнтервала = СтрокаИнтервала.НачалоВременногоИнтервала;
//			Продолжить;	
//		КонецЕсли;
		
		ВремяИнтервала = НачалоПредыдущегоИнтервала - СтрокаИнтервала.НачалоВременногоИнтервала;
		СтрокаВременногоИнтервала = СтрокаВременногоИнтервала(СтрокаИнтервала.ТэгВременногоИнтервала);
		
		СтрокаВременногоИнтервала.ТэгВременногоИнтервала = СтрокаИнтервала.ТэгВременногоИнтервала;
		СтрокаВременногоИнтервала.ВремяВременногоИнтервала = СтрокаВременногоИнтервала.ВремяВременногоИнтервала  
			+ ВремяИнтервала;
			
		НачалоПредыдущегоИнтервала = СтрокаИнтервала.НачалоВременногоИнтервала;
		
	КонецЦикла;
	
	ВременныеИнтервалы.Сортировать("Сортировка Убыв");
	
КонецПроцедуры

&НаКлиенте
Функция СтрокаВременногоИнтервала(ТэгИнтервала)
	
	Отбор = Новый Структура("ТэгВременногоИнтервала", ТэгИнтервала);
	
	СтрокиВременныхИнтервалов = ВременныеИнтервалы.НайтиСтроки(Отбор);
	Если СтрокиВременныхИнтервалов.Количество() Тогда
		СтрокаВременногоИнтервала = СтрокиВременныхИнтервалов.Получить(0);
	Иначе
		СтрокаВременногоИнтервала = ВременныеИнтервалы.Добавить();
		СтрокаВременногоИнтервала.Сортировка = ВременныеИнтервалы.Количество();
	КонецЕсли;
		
	Возврат СтрокаВременногоИнтервала;
	
КонецФункции

&НаКлиенте
Функция КоличествоСекундВИнтервале(ДатаНачала, ДатаОкончания)
	
	НачалоИнтервала = Час(ДатаНачала) * 60 + Секунда(ДатаНачала);
	КонецИнтервала = Час(ДатаОкончания) * 60 + Секунда(ДатаОкончания);
	
	Возврат КонецИнтервала - НачалоИнтервала;
	
КонецФункции

&НаКлиенте
Процедура Команда1(Команда)
	РассчитатьДлительностьВременныхИнтервалов();
КонецПроцедуры

